/* AD: Forest automatic */
"- Automatic -" = "- Automaattinen -";

/* AD: Alert title */
"Account expired or disabled" = "Tili vanhentunut tai poistettu käytöstä";

/* AD: Dialog status message */
"Active Directory only permits slight variations between the clocks on your computer and on the Active Directory server. You should check the time and time zone settings on your computer and reset them if needed." = "Active Directory sallii vain pienen eron tietokoneen kellon ja Active Directory -palvelimen kellon välillä. Tarkista tietokoneen aika- ja aikavyöhykeasetukset ja muuta niitä tarvittaessa.";

/* AD: Alert message */
"Active Directory Plugin requires Mac OS X to control the \\U201c/Library/Preferences/edu.mit.Kerberos\\U201d file.  The existing file will be renamed to \\U201c/Library/Preferences/edu.mit.Kerberos.pre-Active Directory\\U201d." = "Active Directory -liitännäinen edellyttää, että Mac OS X hallitsee /Kirjasto/Preferences/edu.mit.Kerberos-tiedostoa. Olemassa olevan tiedoston nimeksi annetaan ”/Kirjasto/Preferences/edu.mit.Kerberos.pre-Active Directory”.";

/* AD: Alert title */
"Active Directory time error" = "Active Directory -aikavirhe";

/* AD: Dialog status message */
"An invalid Domain and Forest combination was specified.  You should enter a fully qualified DNS name for the domain and forest (e.g., ads.company.com)." = "Määritelty domain- ja metsä-yhdistelmä on virheellinen. Syötä absoluuttinen DNS-nimi domainille ja metsälle (esim. ads.company.com).";

/* AD: Alert title */
"An unknown error occurred" = "Tapahtui tuntematon virhe";

/* AD: Alert message */
"An unknown error occurred reading the configuration." = "Luettaessa määrittelyä tapahtui tuntematon virhe.";

/* AD: Alert message */
"An unknown error occurred updating the configuration." = "Päivitettäessä määrittelyä tapahtui tuntematon virhe.";

/* AD: Dialog status message */
"An unknown error occurred." = "Tapahtui tuntematon virhe.";

/* AD: Alert title
   AD: Alert message */
"Authorization error" = "Valtuutusvirhe";

/* AD: Dynamic button title */
"Bind\\U2026" = "Sido…";

/* AD: Button title */
"Cancel" = "Kumoa";

/* AD: Alert message */
"Configuring on Master or Replica" = "Määrittely masterilla tai kopiolla";

/* AD: Alert title */
"Container does not exist" = "Säiliötä ei ole olemassa";

/* AD: Button title */
"Continue" = "Jatka";

/* AD: Button title */
"Force Unbind" = "Pakota poistamaan sidos";

/* AD: Dynamic button title */
"Hide Advanced Options" = "Kätke lisävalinnat";

/* AD: Alert title */
"Insufficient privileges" = "Riittämättömät oikeudet";

/* AD: Alert title */
"Invalid domain" = "Virheellinen domain";

/* AD: Alert title */
"Invalid user name and password combination" = "Virheellinen käyttäjätunnuksen ja salasanan yhdistelmä";

/* AD: Alert title */
"Join existing account?" = "Liitytäänkö olemassa olevaan tiliin?";

/* AD: Alert title */
"Join Kerberos realm" = "Liity Kerberos-realmiin";

/* AD: Alert title */
"Kerberos file already exists" = "Kerberos-tiedosto on jo olemassa";

/* AD: Alert title */
"Memory allocation error" = "Muistinvarausvirhe";

/* Alert Button */
"OK" = "OK";

/* AD: Dialog status message */
"Removing this computer from Active Directory" = "Poistetaan tietokonetta Active Directorysta";

/* AD: Alert Button */
"Rename" = "Nimeä uudelleen";

/* AD: Dynamic button title */
"Show Advanced Options" = "Näytä lisävalinnat";

/* AD: Dialog status message */
"Step 1 of 5: Searching for Forest/Domain information\\U2026" = "Vaihe 1/5: Etsitään metsä/domain-tietoja…";

/* AD: Dialog status message */
"Step 2 of 5: Finding nearest Domain controllers\\U2026" = "Vaihe 2/5: Etsitään lähimpiä domain-ohjaimia…";

/* AD: Dialog status message */
"Step 3 of 5: Verifying credentials\\U2026" = "Vaihe 3/5: Tarkistetaan valtakirjoja…";

/* AD: Dialog status message */
"Step 4 of 5: Searching for existing computer\\U2026" = "Vaihe 4/5: Etsitään olemassa olevaa tietokonetta…";

/* AD: Dialog status message */
"Step 5 of 5: Binding computer to Domain\\U2026" = "Vaihe 5/5: Sidotaan tietokonetta domainiin…";

/* AD: Dialog status message */
"Step 5 of 5: Joining computer to Domain\\U2026" = "Vaihe 5/5: Liitetään tietokonetta domainiin…";

/* AD: Alert message */
"The account information you entered specifies an account that already exists. Do you wish to join this computer to the existing computer account? This operation cannot be undone." = "Syötetyt tunnustiedot määrittelevät jo olemassa olevan tunnuksen. Haluatko liittää tämän tietokoneen olemassa olevaan tietokonetunnukseen? Tätä toimintoa ei voida perua.";

/* AD: Dialog status message */
"The account information you provided is either expired or disabled. You should provide another administrator account." = "Syötetyt tunnustiedot ovat joko vanhentuneet tai poistettu käytöstä. Syötä toinen ylläpitäjän tunnus.";

/* AD: Dialog status message */
"The administrator account you specified does not have the appropriate privileges to perform the requested operation." = "Syötetyllä ylläpitäjän tunnuksella ei ole vaadittuja oikeuksia pyydetyn toiminnon suorittamiseen.";

/* AD: Dialog status message */
"The container you specified for the computer does not exist.  Please verify the container information and try again." = "Tietokoneelle määriteltyä säiliötä ei ole olemassa. Tarkista säiliön tiedot ja yritä uudelleen.";

/* AD: Dialog status message */
"This computer is unable to access the domain controller for an unknown reason." = "Tämä tietokone ei voi käyttää domainohjainta tuntemattomasta syystä.";

/* AD: Alert message */
"To join this server to the Active Directory Kerberos realm, open Server Admin and select Open Directory for this server. In the Settings pane, click General, then click Join Kerberos and enter credentials for a local administrator on this server." = "Jos haluat liittää tämän palvelimen Active Directoryn Kerberos-realmiin, avaa Server Admin ja valitse Open Directory tälle palvelimelle. Osoita Settings-osiossa General > Join Kerberos ja syötä tämän palvelimen paikallisen ylläpitäjän valtakirjat.";

/* AD: Alert title */
"Unable to access domain controller" = "Domainohjainta ei voida käyttää";

/* AD: Alert message */
"Unable to allocate memory for this operation." = "Tälle toiminnolle ei voida varata muistia.";

/* AD: Alert Title */
"Unable to open Active Directory node" = "Active Directory -solmua ei voida avata";

/* AD: Alert message */
"Unable to open Active Directory node." = "Active Directory -solmua ei voida avata.";

/* AD: Dynamic button title */
"Unbind\\U2026" = "Poista sidos…";

/* AD: Alert message */
"Warning you are configuring the Active Directory Plugin on an Open Directory Master or Replica.  Continuing may cause problems with the Open Directory Kerberos server." = "Varoitus: Olet määrittelemässä Active Directory -liitännäistä Open Directory -masterilla tai -kopiolla. Jatkaminen saattaa aiheuttaa ongelmia Open Directoryn Kerberos-palvelimen kanssa.";

/* AD: Alert message */
"Warning: If you click force unbind you will leave an unused computer account in the directory." = "Varoitus: Jos osoitat ”Pakota poistamaan sidos”, hakemistoon jää käyttämätön tietokonetunnus.";

/* AD: Alert message */
"You are not authorized to read the configuration of this plugin." = "Sinulla ei ole oikeutta lukea tämän liitännäisen määrittelyä.";

/* AD: Alert message */
"You are not authorized to update the configuration" = "Sinulla ei ole oikeutta päivittää määrittelyä";

/* AD: Dialog status message */
"You provided a user name and password combination that is invalid. You should check the user name and password and try again." = "Syötetty käyttäjätunnuksen ja salasanan yhdistelmä on virheellinen. Tarkista käyttäjätunnus ja salasana ja yritä uudelleen.";

